## EJERCICIO TABLAS RELACIONADAS

In [1]:
# Importar librerías
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# Crear Dataframe tabla1
tabla1 = pd.DataFrame({'Alumno':['Pedro', 'Pedro', 'Irene', 'Samuel'], 
                    'Materia':['Matemáticas', 'Literatura', 'Matemáticas', 'Tecnología'], 
                    'Nota':[8.2, 3.4, 5.8, 6.7]})

In [3]:
tabla1

   Alumno      Materia  Nota
0   Pedro  Matemáticas   8.2
1   Pedro   Literatura   3.4
2   Irene  Matemáticas   5.8
3  Samuel   Tecnología   6.7

In [4]:
# Crear DAtaframe tabla2
tabla2 = pd.DataFrame({'Asignatura':['Matemáticas', 'Literatura', 'Biología'], 
                    'Profesor':['Rodríguez', 'Díaz', 'García']})

In [5]:
tabla2

    Asignatura   Profesor
0  Matemáticas  Rodríguez
1   Literatura       Díaz
2     Biología     García

### Tipos de combinación de Dataframes con función pd.merge

In [7]:
# Cambiar el nombre de la variable Asignatura por Materia en la tabla2 para poder hacer merge
tabla2.rename(columns={'Asignatura': 'Materia'}, inplace=True)

In [8]:
tabla2

       Materia   Profesor
0  Matemáticas  Rodríguez
1   Literatura       Díaz
2     Biología     García

In [9]:
# INNER
resultado=pd.merge(tabla1, tabla2, on=['Materia'], how='inner')

In [10]:
resultado

  Alumno      Materia  Nota   Profesor
0  Pedro  Matemáticas   8.2  Rodríguez
1  Pedro   Literatura   3.4       Díaz
2  Irene  Matemáticas   5.8  Rodríguez

In [11]:
# LEFT
resultado=pd.merge(tabla1, tabla2, on=['Materia'], how='left')

In [12]:
resultado

   Alumno      Materia  Nota   Profesor
0   Pedro  Matemáticas   8.2  Rodríguez
1   Pedro   Literatura   3.4       Díaz
2   Irene  Matemáticas   5.8  Rodríguez
3  Samuel   Tecnología   6.7        NaN

In [13]:
# RIGHT
resultado=pd.merge(tabla1, tabla2, on=['Materia'], how='right')

In [14]:
resultado

  Alumno      Materia  Nota   Profesor
0  Pedro  Matemáticas   8.2  Rodríguez
1  Irene  Matemáticas   5.8  Rodríguez
2  Pedro   Literatura   3.4       Díaz
3    NaN     Biología   NaN     García

In [15]:
# OUTER
resultado=pd.merge(tabla1, tabla2, on=['Materia'], how='outer')

In [16]:
resultado

   Alumno      Materia  Nota   Profesor
0     NaN     Biología   NaN     García
1   Pedro   Literatura   3.4       Díaz
2   Pedro  Matemáticas   8.2  Rodríguez
3   Irene  Matemáticas   5.8  Rodríguez
4  Samuel   Tecnología   6.7        NaN